Revit 2020 API
Curve Properties
The Curve type exposes the following members.
Properties
Name | Description
ApproximateLength
The approximate length of the curve.
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
IsBound
Describes whether the parameter of the curve is restricted to a particular interval.
IsCyclic
The boolean value that indicates whether this curve is cyclic.
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Length
The exact length of the curve.
Period
The period of this curve.
Reference
Returns a stable reference to the curve.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
Curve Class
Autodesk.Revit.DB Namespace